# WallDesignThickness Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionColdFormed..::..WallDesignThickness Property
StructuralSectionColdFormed Class See Also
---
Represents wall design thickness of rectangle.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double WallDesignThickness { get; set; }
```

Visual Basic
---
```text
Public Property WallDesignThickness As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double WallDesignThickness {
	double get ();
	void set (double value);
}
```

# Remarks
Design thickness of pipe wall is value should be thinner value than measured real value (nominal).
# See Also
StructuralSectionColdFormed Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace